class Surah {
  final String name;
  final List<String> arabicVerses;
  final List<String> banglaTranslation;

  Surah({
    required this.name,
    required this.arabicVerses,
    required this.banglaTranslation,
  });
}

final List<Surah> surahList = [
  Surah(
    name: "সূরা আল-ফাতিহা",
    arabicVerses: [
      "بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ",
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "الرَّحْمَـٰنِ الرَّحِيمِ",
      "مَالِكِ يَوْمِ الدِّينِ",
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
      "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
    ],
    banglaTranslation: [
      "আল্লাহর নামে শুরু করছি যিনি পরম করুণাময়, অতি দয়ালু।",
      "সমস্ত প্রশংসা আল্লাহর যিনি সমগ্র বিশ্বের প্রতিপালক।",
      "যিনি নিতান্ত মেহেরবান ও দয়ালু।",
      "যিনি বিচার দিনের মালিক।",
      "আমরা একমাত্র তোমারই ইবাদত করি এবং তোমারই সাহায্য প্রার্থনা করি।",
      "আমাদেরকে সরল পথ দেখাও।",
      "তাদের পথ যাদের তুমি নিয়ামত দান করেছ, তাদের পথ নয় যাদের প্রতি গজব হয়েছে এবং যারা পথভ্রষ্ট।"
    ],
  ),

  // 👉 Later you can add more Surah here
];
